{
  "_class_name": "VQModel",
  "_diffusers_version": "0.39.0",
  "in_channels": 3,
  "out_channels": 3,
  "down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "up_block_types": [
    "UpDecoderBlock2D",
    "UpDecoderBlock2D",
    "UpDecoderBlock2D"
  ],
  "block_out_channels": [
    128,
    256,
    512
  ],
  "layers_per_block": 2,
  "act_fn": "silu",
  "latent_channels": 3,
  "sample_size": 256,
  "num_vq_embeddings": 8192,
  "norm_num_groups": 32,
  "vq_embed_dim": 3,
  "scaling_factor": 0.18215,
  "norm_type": "group",
  "mid_block_add_attention": false,
  "lookup_from_codebook": false,
  "force_upcast": false
}